IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cmsysctl_regs.xml
<module id="CMSYSCTL_REGS" HW_revision="" description="CMSYSCTL Registers">
	<register id="CMPCLKCR0" width="32" page="1" offset="0x0" internal="0" description="CM Peripheral clock gating register 0.">
		<bitfield id="UART0" description="UART0 Clock gating Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SSI0" description="SSI0 Clock gating Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="I2C0" description="I2C0 Clock gating Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="USB" description="USB Clock gating Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPCLKCR1" width="32" page="1" offset="0x4" internal="0" description="CM Peripheral clock gating register 1.">
		<bitfield id="ETHERNET" description="ETHERNET Clock gating Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ETHERCAT" description="ETHERCAT Clock gating Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAN_A" description="CAN_A Clock gating Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CAN_B" description="CAN_B Clock gating Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_A" description="MCAN_A Clock gating Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPCLKCR2" width="32" page="1" offset="0x8" internal="0" description="CM Peripheral clock gating register 2.">
		<bitfield id="CPUTIMER0" description="CPUTIMER0 Clock gating Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER1" description="CPUTIMER1 Clock gating Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER2" description="CPUTIMER2 Clock gating Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UDMA" description="UDMA Clock gating Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="AESIP" description="AESIP Clock gating Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GCRC" description="GCRC Clock gating Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMSOFTPRESET0" width="32" page="1" offset="0x20" internal="0" description="CM Software Peripheral Reset register 0">
		<bitfield id="UART0" description="UART0 Soft reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SSI0" description="SSI0 Soft reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="I2C0" description="I2C0 Soft reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="USB" description="USB Soft reset bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMSOFTPRESET1" width="32" page="1" offset="0x24" internal="0" description="CM Software Peripheral Reset register 1">
		<bitfield id="ETHERNET" description="ETHERNET Soft reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ETHERCAT" description="ETHERCAT Soft reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAN_A" description="CAN_A Soft reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CAN_B" description="CAN_B Soft reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_A" description="MCAN_A Soft reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMSOFTPRESET2" width="32" page="1" offset="0x28" internal="0" description="CM Software Peripheral Reset register 2">
		<bitfield id="AESIP" description="AESIP Soft reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GCRC" description="GCRC Soft reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMCLKSTOPREQ0" width="32" page="1" offset="0x40" internal="0" description="Peripheral Clock Stop Request Register 0">
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMCLKSTOPREQ1" width="32" page="1" offset="0x44" internal="0" description="Peripheral Clock Stop Request Register 1">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Request Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMCLKSTOPREQ2" width="32" page="1" offset="0x48" internal="0" description="Peripheral Clock Stop Request Register 2">
		<bitfield id="KEY" description="Key field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMCLKSTOPACK0" width="32" page="1" offset="0x60" internal="0" description="Peripheral Clock Stop Ackonwledge Register 0">
	</register>
	<register id="CMCLKSTOPACK1" width="32" page="1" offset="0x64" internal="0" description="Peripheral Clock Stop Ackonwledge Register 1">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Ack Bit" begin="8" end="8" width="1" rwaccess="R"/>
	</register>
	<register id="CMCLKSTOPACK2" width="32" page="1" offset="0x68" internal="0" description="Peripheral Clock Stop Ackonwledge Register 2">
	</register>
	<register id="MCANWAKESTATUS" width="32" page="1" offset="0xe0" internal="0" description="MCAN Wake Status Register">
		<bitfield id="WAKE" description="MCAN Wake Status " begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUSCLR" width="32" page="1" offset="0xe4" internal="0" description="MCAN Wake Status Clear Register">
		<bitfield id="WAKE" description="Cear bit for MCANWAKESTATUS.WAKE bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CMECATCTL" width="32" page="1" offset="0x100" internal="0" description="CM etherCAT control register">
		<bitfield id="I2CLOOPBACK" description="Loopback I2C port of etherCAT IP to CM I2C." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PALLOCATESTS" width="32" page="1" offset="0x1f4" internal="0" description="Status of PALLOCATE register.">
		<bitfield id="USB" description="Status of PALLOCATE.USB bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ETHERCAT" description="Status of PALLOCATE.ETHERCAT bit" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CAN_A" description="Status of PALLOCATE.CAN_A bit" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CAN_B" description="Status of PALLOCATE.CAN_B bit" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MCAN_A" description="Status of PALLOCATE.MCAN_A bit" begin="4" end="4" width="1" rwaccess="R"/>
	</register>
	<register id="CMRESCCLR" width="32" page="1" offset="0x1f8" internal="0" description="CM Reset Cause Status Clear Register">
		<bitfield id="PORESETn" description="PORESETn status flag clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XRSn" description="XRSn status flag clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU1WDRSn" description="CPU1WDRSn status flag clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPU1NMIWDRSn" description="CPU1NMIWDRSn status flag clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CPU1SYSRSN" description="CPU1SYSRSN status flag clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPU1SCCRESETn" description="CPU1SCCRESETn status flag clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECAT_RESET_OUT" description="ECAT_RESET_OUT status flag clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CPU1SIMRESET_CPURSn" description="CPU1SIMRESET_CPURSn status flag clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMRSTCTLRESETREQ" description="CMRSTCTLRESETREQ status flag clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_SIMRESET_XRSn" description="CPU1_SIMRESET_XRSn status flag clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMVECTRESETn" description="CMVECTRESETn status flag clear" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMSYSRESETREQ" description="CMSYSRESETREQ status flag clear" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMNMIWDRSTn" description="CMNMIWDRSTn status flag clear" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMEOLRESETn" description="CMEOLRESETn status flag clear" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
	<register id="CMRESC" width="32" page="1" offset="0x1fc" internal="0" description="CM Reset Cause Status Register">
		<bitfield id="PORESETn" description="PORESETn caused the reset of CM" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="XRSn" description="XRSn caused the reset of CM" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CPU1_WDRSn" description="CPU1_WDRSn caused the reset of CM" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CPU1_NMIWDRSn" description="CPU1_NMIWDRSn caused the reset of CM" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CPU1_SYSRSN" description="CPU1_SYSRSN caused the reset of CM" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CPU1_SCCRESETn" description="CPU1_SCCRESETn caused the reset of CM" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ECAT_RESET_OUT" description="ECAT_RESET_OUT caused the reset of CM" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CPU1_SIMRESET_CPURSn" description="CPU1_SIMRESET_CPURSn caused the reset of CM" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CMRSTCTL_RESETREQ" description="CMRSTCTL_RESETREQ caused the reset of CM" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CPU1_SIMRESET_XRSn" description="CPU1_SIMRESET_XRSn caused the reset of CM" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMVECTRESETn" description="CMVECTRESETn caused the reset of CM" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CMSYSRESETREQ" description="CMSYSRESETREQ caused the reset of CM" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CMNMIWDRSTn" description="CMNMIWDRSTn caused the reset of CM" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CMEOLRESETn" description="CMEOLRESETn caused the reset of CM" begin="19" end="19" width="1" rwaccess="R"/>
	</register>
	<register id="CMSYSCTLLOCK" width="32" page="1" offset="0x200" internal="0" description="Locks the configuration registers of CM System control">
		<bitfield id="LOCK" description="Locks the configuration registers of CM System Control" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
